import type { ReactNode } from "react";

import Image from "next/image";

import homa from "@/assets/images/homa-rousta1.webp";

import styles from "./memories.module.css";

export default function MemoriesComponent(): ReactNode {
  return (
    <div className={styles.memories}>
      <div className={styles.text}>
        <p>
          هما روستا در بیان خاطرات خود می‌گوید که چگونه در هشت‌سالگی توسط عوامل
          حزب توده در ایران، با پاسپورت جعلی از تهران ربوده و (پس از یک سال
          سرگردانی در قاهره، رُم، وین و بوداپست) به مسکو فرستاده می‌شود.
        </p>

        <p>
          در آن‌جا، زندگی سرد و غم‌انگیزی را آغاز می‌کند. تنهایی و دوری از
          مادرش، او را به شدت رنج می‌دهد تا این‌که پدرش دوباره ازدواج می‌کند و
          زنِ پدرش Eugenia با مهربانی‌های خود، جای خالی مادر را برای او پر
          می‌کند.
        </p>

        <p>
          در چهارده‌سالگی همراه پدرش به برلین‌ شرقی می‌رود و در آن‌جا به تحصیلات
          خود ادامه می‌دهد و سپس وارد دانشگاه می‌شود. همان‌جا به اصرار پدرش در
          رشته‌ی شیمی سرگرم درس خواندن می‌شود و پس از آن‌که سال تحصیلی را با
          موفقیت به پایان می‌رساند، برای گذراندن تعطیلات تابستانی به سوئیس
          می‌رود. در زوریخ با یک جوان ایرانی که در برلین غربی زندگی می‌کند آشنا
          می‌شود و در مدت کوتاهی، آشنایی آن‌ها به عشق می‌انجامد. (هما این مرد را
          آقای "غربی" می‌نامد.)
        </p>

        <p>
          کمیته‌ی مرکزی حزب توده و رضا روستا، وقتی از جریان عشق این دو د‌لداده
          آگاه می‌شوند، به علت این‌که "غربی" از مخالفان کمونیسم است، هما را
          مخفیانه به رومانی می‌فرستند تا بین عاشق و معشوق جدایی افتد.
        </p>

        <p>
          هما یک روز قبل از سفرش به بخارست، به راز توطئه‌ای علیه ایران
          پی‌‌می‌برد و می‌فهمد که پدرش ماموریت یافته است به عنوان یک تاجر
          ایتالیایی به تهران بیاید و در ایجاد حوادث، مخالفین ِ ضدِ رژیم را رهبری
          کند. هما هم‌چنین پی‌می‌برد که پدرش به‌ عللی، تمام نامه‌های او را که از
          بچگی به مادرش نوشته است، در گاوصندوق خود بایگانی کرده است. با پدرش قهر
          می‌کند و بدون دیدن او به بخارست می‌رود
        </p>

        <p>
          سردی روابط پدر و دختر، دو سال طول می‌کشد تا این‌که در تعطیلات February
          سال 1968، هما ناگهانی به برلین بازمی‌گردد و می‌فهمد پدرش سخت بیمار
          است.
        </p>

        <p>
          خود را به هر ترتیبی هست به بیمارستان می‌رساند و ضمن گفتگو با پزشکان و
          پرستاران، متوجه می‌شود که پدرش در حال مرگ است.
        </p>

        <p>
          رضا روستا پس از ده روز بیماری، به‌طرز مشکوکی در بیمارستان Charité
          Universitätsmedizin Berlin می‌میرد و دکتر Häntze (دکتر جوانی که مسئول
          بخش است، به هما علاقه‌مند شده است و نسبت به او Sympathy دارد) مخفیانه
          نزد او اعتراف می‌کند که رضا روستا را، عوامل حزب توده، با تبانی با
          دکترهای بیمارستان به قتل رسانده‌اند.
        </p>

        <p>
          هما پس از مدتی، برای ادامه‌ی تحصیلاتش به بخارست بازمی‌گردد و در آن‌جا
          برای بازگشت به ایران و گرفتن پاسپورت تلاش می‌کند و دو سال بعد، (پس از
          پایان تحصیلاتش در رشته‌ی هنرهای Dramatic)، دوباره به برلین بازمی‌گردد.
        </p>

        <p>
          پس از مدتی در خیابان، به‌طور ناگهانی با "غربی" رو‌به‌رو می‌شود. عشق
          آن‌ها دوباره تجدید می‌شود و "غربی" قول می‌دهد که برای گرفتن پاسپورت و
          بازگرداندن او به ایران تلاش کند. هما پس از مدتی می‌فهمد که "غربی"، زن
          و یک بچه دارد. شنیدن این خبر، او را خیلی ناراحت و پریشان می‌کند و برای
          فرار از غم شکست و ناکامی، به لهستان می‌رود و مدتی نزد پسرعمو‌یش
          می‌ماند. در بازگشت، نامه‌ای از "غربی" در انتظار اوست ...
        </p>
      </div>
      <Image src={homa} alt="" />
    </div>
  );
}
